{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Intro"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Generate [object_per_actor_nmvw.csv](object_per_actor_nmvw.csv)\n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?nmvw_object) AS ?no_object) ?nmvw_actor\n",
    "WHERE{\n",
    "  GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "  {?nmvw_acq crm:P24_transferred_title_of ?nmvw_object .\n",
    "   ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor .}\n",
    "  UNION\n",
    "  {\n",
    "    ?nmvw_prod crm:P14_carried_out_by ?nmvw_actor .\n",
    "    ?nmvw_object crm:P108i_was_produced_by ?nmvw_prod .\n",
    "  }\n",
    "  ?nmvw_object a crm:E22_Human-Made_Object .\n",
    "  }\n",
    "}GROUP BY ?nmvw_actor\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>no_object</th>\n",
       "      <th>nmvw_actor</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>4564</th>\n",
       "      <td>135424</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi4332\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4048</th>\n",
       "      <td>69382</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi40292\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2608</th>\n",
       "      <td>13609</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi3358\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1448</th>\n",
       "      <td>9729</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi2246\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7559</th>\n",
       "      <td>7464</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi57572\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2558</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi32984\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2560</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi3300\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2561</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi3305\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7653</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi57704\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11954</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://hdl.handle.net/20.500.11840/pi999\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>11955 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       no_object                                       nmvw_actor\n",
       "4564      135424    \"https://hdl.handle.net/20.500.11840/pi4332\" \n",
       "4048       69382   \"https://hdl.handle.net/20.500.11840/pi40292\" \n",
       "2608       13609    \"https://hdl.handle.net/20.500.11840/pi3358\" \n",
       "1448        9729    \"https://hdl.handle.net/20.500.11840/pi2246\" \n",
       "7559        7464   \"https://hdl.handle.net/20.500.11840/pi57572\" \n",
       "...          ...                                              ...\n",
       "2558           1   \"https://hdl.handle.net/20.500.11840/pi32984\" \n",
       "2560           1    \"https://hdl.handle.net/20.500.11840/pi3300\" \n",
       "2561           1    \"https://hdl.handle.net/20.500.11840/pi3305\" \n",
       "7653           1   \"https://hdl.handle.net/20.500.11840/pi57704\" \n",
       "11954          1     \"https://hdl.handle.net/20.500.11840/pi999\" \n",
       "\n",
       "[11955 rows x 2 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup(x: str):\n",
    "    return int(str(x).replace('\"', '').strip())\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"object_per_actor_nmvw.csv\")\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = ['no_object', 'nmvw_actor']\n",
    "df1['no_object'] = df1['no_object'].apply(cleanup)\n",
    "df1 = df1.sort_values(by=['no_object'], ascending=False)\n",
    "df1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Generate [object_per_actor_bb.csv](object_per_actor_bb.csv)\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?bb_obj) AS ?no_object) ?bb_actor\n",
    "WHERE{\n",
    "    {?bb_acq crm:P23_transferred_title_from ?bb_actor .\t\n",
    "    ?bb_acq crm:P24_transferred_title_of ?bb_obj .}\n",
    "    UNION\n",
    "    {\n",
    "          ?bb_obj crm:P51_has_former_or_current_owner ?bb_actor .\n",
    "    }\n",
    "\n",
    "GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_obj a crm:E22_Human-Made_Object. }\n",
    "}GROUP BY ?bb_actor\n",
    "```\n",
    "> Note: https://pressingmatter.nl/Bronbeek/Constituents/1896\" --> \"Koninklijk Tehuis voor Oud-Militairen en Museum Bronbeek\"^^xsd:string\n",
    "> https://pressingmatter.nl/Bronbeek/Constituents/9806 --> Nijmeegs Volkenkundig Museum\n",
    "> https://pressingmatter.nl/Bronbeek/Constituents/9804 --> \"Gemeente Nijmegen\"\n",
    "> https://pressingmatter.nl/Bronbeek/Constituents/9805 --> Jean Louis Henri Beijens"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>no_object</th>\n",
       "      <th>bb_actor</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2663</th>\n",
       "      <td>12409</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6998</th>\n",
       "      <td>3066</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6996</th>\n",
       "      <td>3066</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6997</th>\n",
       "      <td>3066</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4227</th>\n",
       "      <td>1542</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5181</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5182</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5183</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2343</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7117</th>\n",
       "      <td>1</td>\n",
       "      <td>\"https://pressingmatter.nl/Bronbeek/Constitue...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7118 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      no_object                                           bb_actor\n",
       "2663      12409   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "6998       3066   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "6996       3066   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "6997       3066   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "4227       1542   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "...         ...                                                ...\n",
       "5181          1   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "5182          1   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "5183          1   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "2343          1   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "7117          1   \"https://pressingmatter.nl/Bronbeek/Constitue...\n",
       "\n",
       "[7118 rows x 2 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup(x: str):\n",
    "    return int(str(x).replace('\"', '').strip())\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"object_per_actor_bb.csv\")\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = ['no_object', 'bb_actor']\n",
    "df1['no_object'] = df1['no_object'].apply(cleanup)\n",
    "df1 = df1.sort_values(by=['no_object'], ascending=False)\n",
    "df1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ-1a"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "How many actors we have with one more objects and also have military background?"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "SPARQL Query:\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?nmvw_actor) AS ?no_actor)\n",
    "WHERE{\n",
    "  GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "  {?nmvw_acq crm:P24_transferred_title_of ?nmvw_object .\n",
    "   ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor .}\n",
    "  UNION\n",
    "  {\n",
    "    ?nmvw_prod crm:P14_carried_out_by ?nmvw_actor .\n",
    "    ?nmvw_object crm:P108i_was_produced_by ?nmvw_prod .\n",
    "  }\n",
    "  ?nmvw_object a crm:E22_Human-Made_Object .\n",
    "  }\n",
    "  ?nmvw_actor owl:sameAs ?bb_actor .\n",
    "}\n",
    "```\n",
    "\n",
    "> Note that, here we consider `production actor` too! "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1. **Initial+Surname Match**: 277 actor from NMVW dataset, has connection with at least one object's provenance from NMVW dataset and also have owl:sameAS link with Bronbeek actor.\n",
    "2. **Exact String Matching**: 117 actor from NMVW dataset, has connection with at least one object's provenance from NMVW dataset and also have owl:sameAS link with Bronbeek actor.\n",
    "3. **Surname Matching**: 2680 actor from NMVW dataset, has connection with at least one object's provenance from NMVW dataset and also have owl:sameAS link with Bronbeek actor.\n",
    "4. **Fuzzy String Matching**: 6779 actor from NMVW dataset, has connection with at least one object's provenance from NMVW dataset and also have owl:sameAS link with Bronbeek actor.\n",
    "5. **Deezy Match**: 87 actor from NMVW dataset, has connection with at least one object's provenance from NMVW dataset and also have owl:sameAS link with Bronbeek actor.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ 1b"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate [CQ1b_nmvw_obj.csv](CQ1b_nmvw_obj.csv)\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT ?nmvw_object ?nmvw_actor\n",
    "WHERE{\n",
    "  GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "  {?nmvw_acq crm:P24_transferred_title_of ?nmvw_object .\n",
    "   ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor .}\n",
    "  UNION\n",
    "  {\n",
    "    ?nmvw_prod crm:P14_carried_out_by ?nmvw_actor .\n",
    "    ?nmvw_object crm:P108i_was_produced_by ?nmvw_prod .\n",
    "  }\n",
    "  ?nmvw_object a crm:E22_Human-Made_Object .\n",
    "  }\n",
    "  # removing \"onbeked / unknown\"\n",
    "  FILTER (?nmvw_actor != <https://hdl.handle.net/20.500.11840/pi4332>)\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nmvw_object</th>\n",
       "      <th>nmvw_actor</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/128796</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi1125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/22185</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi39586</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/22199</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/22199</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi39586</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/22201</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2354</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>621439</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/277225</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi44822</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>621440</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/277226</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2687</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>621441</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/277227</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2246</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>621442</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/277228</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2246</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>621443</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/277229</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2246</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>621444 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       nmvw_object  \\\n",
       "0       https://hdl.handle.net/20.500.11840/128796   \n",
       "1        https://hdl.handle.net/20.500.11840/22185   \n",
       "2        https://hdl.handle.net/20.500.11840/22199   \n",
       "3        https://hdl.handle.net/20.500.11840/22199   \n",
       "4        https://hdl.handle.net/20.500.11840/22201   \n",
       "...                                            ...   \n",
       "621439  https://hdl.handle.net/20.500.11840/277225   \n",
       "621440  https://hdl.handle.net/20.500.11840/277226   \n",
       "621441  https://hdl.handle.net/20.500.11840/277227   \n",
       "621442  https://hdl.handle.net/20.500.11840/277228   \n",
       "621443  https://hdl.handle.net/20.500.11840/277229   \n",
       "\n",
       "                                         nmvw_actor  \n",
       "0        https://hdl.handle.net/20.500.11840/pi1125  \n",
       "1       https://hdl.handle.net/20.500.11840/pi39586  \n",
       "2        https://hdl.handle.net/20.500.11840/pi7008  \n",
       "3       https://hdl.handle.net/20.500.11840/pi39586  \n",
       "4        https://hdl.handle.net/20.500.11840/pi2354  \n",
       "...                                             ...  \n",
       "621439  https://hdl.handle.net/20.500.11840/pi44822  \n",
       "621440   https://hdl.handle.net/20.500.11840/pi2687  \n",
       "621441   https://hdl.handle.net/20.500.11840/pi2246  \n",
       "621442   https://hdl.handle.net/20.500.11840/pi2246  \n",
       "621443   https://hdl.handle.net/20.500.11840/pi2246  \n",
       "\n",
       "[621444 rows x 2 columns]"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup(x: str):\n",
    "    return int(str(x).replace('\"', '').strip())\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"CQ1b_nmvw_obj.csv\")\n",
    "df1 = df1.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = ['nmvw_object', 'nmvw_actor']\n",
    "df1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "444516\n"
     ]
    }
   ],
   "source": [
    "# Group by 'nmvw_actor' and count unique 'nmvw_object' per group\n",
    "unique_counts = df1.groupby('nmvw_actor')['nmvw_object'].nunique()\n",
    "\n",
    "# Filter rows where 'nmvw_actor' has less than 2 unique 'nmvw_object'\n",
    "filtered_df = df1[df1['nmvw_actor'].isin(unique_counts[unique_counts > 1].index)]\n",
    "\n",
    "print(filtered_df['nmvw_object'].nunique())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> out of 446,310 unique objects who have connection with actor, 444,517 can be linked with at least one other objects"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Generate [CQ1b_bb_obj.csv](CQ1b_bb_obj.csv)\n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT ?nmvw_actor (COUNT(DISTINCT ?bb_object) AS ?n_bb_object) \n",
    "WHERE{\n",
    "    ?nmvw_actor owl:sameAs ?bb_actor .\n",
    "    #acquisition event\n",
    "    {\n",
    "    \t?bb_acq crm:P23_transferred_title_from ?bb_actor .   \n",
    "    \t?bb_acq crm:P24_transferred_title_of ?bb_object .\n",
    "    }\n",
    "  UNION\n",
    "    {\n",
    "      \t?bb_object crm:P51_has_former_or_current_owner ?bb_actor .\n",
    "    }\n",
    "  GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_object a crm:E22_Human-Made_Object .\n",
    "    }\n",
    "} GROUP BY ?nmvw_actor\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "310"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup(x: str):\n",
    "    return int(str(x).replace('\"', '').strip())\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df2 = pd.read_csv(\"CQ1b_bb_obj.csv\")\n",
    "df2 = df2.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "# df2 = df2.iloc[: , :-1]\n",
    "df2.columns = [\"nmvw_actor\", \"bb_object\" ]\n",
    "df2['bb_object'] = df2['bb_object'].apply(cleanup)\n",
    "\n",
    "df2 = df2[df2['nmvw_actor'].isin(df1['nmvw_actor'])]\n",
    "\n",
    "df2[\"bb_object\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The number of actor contributing to this object count is: 36\n"
     ]
    }
   ],
   "source": [
    "print(f\"The number of actor contributing to this object count is: {df2['nmvw_actor'].nunique()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> does any of the actor who have only one object, now have more than one connected object due to the connection of bronbeek,"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "15"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df2[df2['nmvw_actor'].isin(unique_counts[unique_counts == 1].index)]['nmvw_actor'].nunique()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "325"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "310 + 15"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ 1c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "How many possible object to object connection we have, by establishing links via actor?"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Generate [CQ1b_nmvw_obj.csv](CQ1b_nmvw_obj.csv)\n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?nmvw_object) AS ?n_nmvw_object) ?nmvw_actor\n",
    "WHERE{\n",
    "  GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "  {?nmvw_acq crm:P24_transferred_title_of ?nmvw_object .\n",
    "   ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor .}\n",
    "  UNION\n",
    "  {\n",
    "    ?nmvw_prod crm:P14_carried_out_by ?nmvw_actor .\n",
    "    ?nmvw_object crm:P108i_was_produced_by ?nmvw_prod .\n",
    "  }\n",
    "  ?nmvw_object a crm:E22_Human-Made_Object .\n",
    "  }\n",
    "  # removing \"onbeked / unknown\"\n",
    "  FILTER (?nmvw_actor != <https://hdl.handle.net/20.500.11840/pi4332>)\n",
    "}GROUP BY ?nmvw_actor\n",
    "```\n",
    "\n",
    "> Note: https://hdl.handle.net/20.500.11840/pi40292 / \"Stichting Indisch Wetenschappelijk Instituut\" generate 69382 object connection but keeping this for now. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cleanup(x: str):\n",
    "    return int(str(x).replace('\"', '').strip())\n",
    "\n",
    "import math\n",
    "\n",
    "def calculate_combinations(total_objects):\n",
    "    combination_value = math.factorial(total_objects) // (math.factorial(2) * math.factorial(total_objects - 2))\n",
    "    return combination_value\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"CQ1b_nmvw_obj.csv\")\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = ['n_nmvw_object', 'nmvw_actor']\n",
    "df1['n_nmvw_object'] = df1['n_nmvw_object'].apply(cleanup)\n",
    "df1 = df1[df1.n_nmvw_object != 1]\n",
    "df1 = df1.sort_values(by=['n_nmvw_object'], ascending=False)\n",
    "df1['possible_connections'] = df1['n_nmvw_object'].apply(calculate_combinations)\n",
    "df1['possible_connections'].sum()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "How many object to object connection we have, by establishing links via actor when we also add objects from bronbeek via the owl:sameAs connection? \n",
    "\n",
    "Generate [CQ1b_bb_obj.csv](CQ1b_bb_obj.csv)\n",
    "SPARQL QUERY:\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT ?nmvw_actor (COUNT(DISTINCT ?bb_object) AS ?n_bb_object) \n",
    "WHERE{\n",
    "    ?nmvw_actor owl:sameAs ?bb_actor .\n",
    "    #acquisition event\n",
    "    {\n",
    "    \t?bb_acq crm:P23_transferred_title_from ?bb_actor .   \n",
    "    \t?bb_acq crm:P24_transferred_title_of ?bb_object .\n",
    "    }\n",
    "  UNION\n",
    "    {\n",
    "      \t?bb_object crm:P51_has_former_or_current_owner ?bb_actor .\n",
    "    }\n",
    "  GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_object a crm:E22_Human-Made_Object .\n",
    "    }\n",
    "} GROUP BY ?nmvw_actor\n",
    "\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "def cleanup(x: str):\n",
    "    return int(str(x).replace('\"', '').strip())\n",
    "\n",
    "import math\n",
    "\n",
    "def calculate_combinations(total_objects):\n",
    "    combination_value = math.factorial(total_objects) // (math.factorial(2) * math.factorial(total_objects - 2))\n",
    "    return combination_value\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df2 = pd.read_csv(\"CQ1b_bb_obj.csv\")\n",
    "df2 = df2.iloc[: , :-1]\n",
    "df2.columns = [\"nmvw_actor\" , \"n_bb_object\"]\n",
    "df2['n_bb_object'] = df2['n_bb_object'].apply(cleanup)\n",
    "df2 = df2.sort_values(by=['n_bb_object'], ascending=False)\n",
    "df2\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Merge the dataframes on 'nmvw_actor'\n",
    "merged_df = pd.merge(df1, df2, on='nmvw_actor', how='left')\n",
    "merged_df['n_bb_object'] = merged_df['n_bb_object'].fillna(0)\n",
    "\n",
    "# Add the 'n_nmvw_object' and 'n_bb_object' columns where 'nmvw_actor' matches\n",
    "merged_df['combined_values'] = merged_df['n_nmvw_object'] + merged_df['n_bb_object']\n",
    "\n",
    "merged_df['possible_connections'] = merged_df['combined_values'].apply(calculate_combinations)\n",
    "merged_df['possible_connections'].sum()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ 2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "SPARQL Query:\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?nmvw_object) AS ?n)\n",
    "WHERE{\n",
    "  Graph <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "    {\n",
    "     ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor .\n",
    "     ?nmvw_acq crm:P24_transferred_title_of ?nmvw_object .\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "      ?nmvw_object crm:P108i_was_produced_by ?nmvw_prod .\n",
    "      ?nmvw_prod crm:P14_carried_out_by ?nmvw_actor .\n",
    "    }\n",
    "    ?nmvw_object  a crm:E22_Human-Made_Object .\n",
    "  }\n",
    "  ?nmvw_actor owl:sameAs ?bronbeek_actor .\n",
    "}\n",
    "```\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ 3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Generate [CQ3_nmvw_obj.csv](CQ3_nmvw_obj.csv)\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT *\n",
    "WHERE{\n",
    "  Graph <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "     ?nmvw_acq1 crm:P23_transferred_title_from ?nmvw_actor1 .\n",
    "     ?nmvw_acq1 crm:P24_transferred_title_of ?nmvw_object .\n",
    "    \n",
    "    ?nmvw_acq2 crm:P24_transferred_title_of ?nmvw_object .\n",
    "    ?nmvw_acq2 crm:P23_transferred_title_from ?nmvw_actor2 .\n",
    "    \n",
    "    Filter (?nmvw_actor1!= ?nmvw_actor2)\n",
    "   }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unique two person's pair in nmvw dataset is: 3878\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"CQ3_nmvw_obj.csv\")\n",
    "df1 = df1.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = [\"nmvw_acq1\" , \"nmvw_actor1\" , \"nmvw_object\" , \"nmvw_acq2\" , \"nmvw_actor2\"]\n",
    "\n",
    "pairs = set(frozenset(pair) for pair in zip(df1['nmvw_actor1'], df1['nmvw_actor2']))\n",
    "df1 = pd.DataFrame(pairs, columns=['nmvw_actor1', 'nmvw_actor2'])\n",
    "\n",
    "print(f\"Unique two person's pair in nmvw dataset is: {len(df1)}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "generate [CQ3_bb_obj.csv](CQ3_bb_obj.csv)\n",
    "\n",
    "```\n",
    "SELECT * WHERE{\n",
    "     ?bb_acq1 crm:P23_transferred_title_from ?bb_actor1 .\n",
    "     ?bb_acq1 crm:P24_transferred_title_of ?bb_object .\n",
    "    \n",
    "    ?bb_acq2 crm:P24_transferred_title_of ?bb_object .\n",
    "    ?bb_acq2 crm:P23_transferred_title_from ?bb_actor2 .\n",
    "\n",
    "    Filter (?bb_actor1!= ?bb_actor2)\n",
    "Graph <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "        ?bb_object a crm:E22_Human-Made_Object.\n",
    "   }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unique two person's pair in bronbeek dataset is: 488\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "df2 = pd.read_csv(\"CQ3_bb_obj.csv\")\n",
    "# df2 = df2.iloc[: , :-1]\n",
    "df2.columns = [  \"bb_acq1\" , \"bb_actor1\" , \"bb_object\" , \"bb_acq2\" , \"bb_actor2\"]\n",
    "\n",
    "pairs = set(frozenset(pair) for pair in zip(df2['bb_actor1'], df2['bb_actor2']))\n",
    "df2 = pd.DataFrame(pairs, columns=['bb_actor1', 'bb_actor2'])\n",
    "\n",
    "print(f\"Unique two person's pair in bronbeek dataset is: {len(df2)}\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Download the match results in [sameAs.csv](sameAs.csv)\n",
    "\n",
    "SPARQL QUERY:\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "SELECT * WHERE{\n",
    "  ?nmwv_actor owl:sameAs ?bb_actor .\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [],
   "source": [
    "match_df = pd.read_csv(\"sameAs.csv\")\n",
    "# match_df = match_df.iloc[:, :-1]\n",
    "match_df.columns = [ \"nmvw_actor\" , \"bb_actor\"]\n",
    "\n",
    "merged_df1 = df1.merge(match_df, left_on='nmvw_actor1', right_on='nmvw_actor', how='inner')\n",
    "merged_df2 = df1.merge(match_df, left_on='nmvw_actor2', right_on='nmvw_actor', how='inner')\n",
    "final_df = pd.concat([merged_df1, merged_df2])\n",
    "final_df = final_df.drop_duplicates()\n",
    "\n",
    "result_df1 = final_df.merge(df2, left_on='bb_actor', right_on='bb_actor1', how='inner')\n",
    "result_df2 = final_df.merge(df2, left_on='bb_actor', right_on='bb_actor2', how='inner')\n",
    "result_df = pd.concat([result_df2,result_df1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The number of new pairs of actor-to-actor connection added is: 2\n"
     ]
    }
   ],
   "source": [
    "pair_list = list()\n",
    "\n",
    "for _, row in result_df.iterrows():\n",
    "    if row['nmvw_actor1'] == row['nmvw_actor']:\n",
    "        x1 = row['nmvw_actor1']\n",
    "        x = row['nmvw_actor2']\n",
    "    else:\n",
    "        x = row['nmvw_actor1']\n",
    "\n",
    "    if row['bb_actor1'] == row['bb_actor']:\n",
    "        y =  row['bb_actor2']\n",
    "    else:\n",
    "        y =  row['bb_actor1']\n",
    "    \n",
    "    pair_list.append(frozenset((x,y)))\n",
    "    try:\n",
    "        pair_list.append(frozenset((x1,y)))\n",
    "    except NameError:\n",
    "        print(f\"{row['nmvw_actor1']} never apprears in sameAs\")\n",
    "\n",
    "pair_set = set(pair_list)\n",
    "pair_df = pd.DataFrame(pair_set, columns=['actor1', 'actor2'])\n",
    "\n",
    "print(f\"The number of new pairs of actor-to-actor connection added is: {len(pair_df)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unique NMVW actor: 2\n"
     ]
    }
   ],
   "source": [
    "all_values = pd.concat([pair_df['actor1'], pair_df['actor2']])\n",
    "\n",
    "# Get unique values\n",
    "unique_values = all_values.unique()\n",
    "\n",
    "# Filter unique values that start with the specified prefix\n",
    "prefix = 'https://hdl.handle.net/'\n",
    "filtered_values = [value for value in unique_values if value.startswith(prefix)]\n",
    "\n",
    "print(f\"Unique NMVW actor: {len(filtered_values)}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ 4"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### These are the objects, where we do not know it's production place, but do know the acqusuiton actor.\n",
    "> For 49152 object we did not know the production location\n",
    "\n",
    "```PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?nmvw_obj) AS ?no_object) ?nmvw_actor\n",
    "WHERE{\n",
    " GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "    ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor.\n",
    "    ?nmvw_acq crm:P24_transferred_title_of ?nmvw_obj .\n",
    "    ?nmvw_obj crm:P108i_was_produced_by ?nmvw_prod .\n",
    "    FILTER NOT EXISTS {\n",
    "      ?nmvw_prod crm:P7_took_place_at ?nmvw_prod_place.}\n",
    "    }\n",
    "} GROUP BY ?nmvw_actor ```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### These are the objects, where we DO KNOW it's production place, and acqusuiton actor.\n",
    "> For 457722 object, we did not know the production location\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?nmvw_obj) AS ?no_object) (COUNT(DISTINCT ?nmvw_prod_place) AS ?no_place) ?nmvw_actor\n",
    "WHERE{\n",
    " GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "     ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor.\n",
    "      ?nmvw_acq crm:P24_transferred_title_of ?nmvw_obj .\n",
    "      ?nmvw_obj crm:P108i_was_produced_by ?nmvw_prod .\n",
    "     ?nmvw_prod crm:P7_took_place_at ?nmvw_prod_place.\n",
    "    }\n",
    "} GROUP BY ?nmvw_actor \n",
    "```\n",
    "\n",
    "> If we connect them with acqusistion_actor, for 45756 objects we can prioritise possible location ."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"CQ4_nmvw_object_place_unknown.csv\")\n",
    "df1 = df1.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "df2 = pd.read_csv(\"CQ4_nmvw_object_place_known.csv\")\n",
    "df2 = df2.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "From nmvw dataset, we have 45756 objects where they are connected to actor whose at least one object has known production location.\n"
     ]
    }
   ],
   "source": [
    "merged_df = pd.merge(df1, df2, on='nmvw_actor', how='inner')\n",
    "print(f\"From nmvw dataset, we have {merged_df['no_object_x'].sum()} objects where they are connected to actor whose at least one object has known production location.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Object connected to Bronbeek actors that as sameAs Links with NMVW\n",
    "\n",
    "Query to generate [CQ4_bb_object.csv](CQ4_bb_object.csv):\n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "\n",
    "SELECT (COUNT(DISTINCT ?bb_obj) AS ?no_object) ?bb_actor\n",
    "WHERE{\n",
    "    ?nmvw_actor owl:sameAs ?bb_actor .\n",
    "    {?bb_acq crm:P23_transferred_title_from ?bb_actor .\t\n",
    "    ?bb_acq crm:P24_transferred_title_of ?bb_obj .}\n",
    "    UNION{\n",
    "          ?bb_obj crm:P51_has_former_or_current_owner ?bb_actor .\n",
    "}\n",
    "\n",
    " GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_obj a crm:E22_Human-Made_Object. }\n",
    "} GROUP BY ?bb_actor \n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "From bronbeek dataset, we have 1030 objects that are connected with an actor who have owl:sameAs link to nmvw dataset\n"
     ]
    }
   ],
   "source": [
    "def cleanup(x: str):\n",
    "    return int(str(x).replace('\"', '').strip())\n",
    "\n",
    "df3 = pd.read_csv(\"CQ4_bb_object.csv\")\n",
    "df3 = df3.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "# df3 = df3.iloc[: , :-1]\n",
    "df3.columns = [\"no_object\" , \"bb_actor\"]\n",
    "df3['no_object'] = df3['no_object'].apply(cleanup)\n",
    "print(f\"From bronbeek dataset, we have {df3['no_object'].sum()} objects that are connected with an actor who have owl:sameAs link to nmvw dataset\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Generate query for [sameAs.csv](sameAs.csv)\n",
    "```\n",
    "SELECT * WHERE{\n",
    "    ?nmvw_acotr owl:sameAs ?bb_actor .\n",
    "}```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [],
   "source": [
    "df4 = pd.read_csv(\"sameAs.csv\")\n",
    "df4 = df4.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "# df4 = df4.iloc[: , :-1]\n",
    "df4.columns = ['nmvw_actor' , 'bb_actor']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "240"
      ]
     },
     "execution_count": 108,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "merged_df = pd.merge(df3, df4, on='bb_actor', how='inner')\n",
    "# when there is multiple match on the bb actor, only kept the first match\n",
    "merged_df = merged_df.drop_duplicates(subset='bb_actor')\n",
    "merged_df = pd.merge(merged_df, df2, on='nmvw_actor', how='inner')\n",
    "merged_df['no_object_x'].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total actor involved: 27\n"
     ]
    }
   ],
   "source": [
    "print(f\"Total actor involved: {merged_df['nmvw_actor'].nunique()}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "45996"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "240 + 45756"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- **Exact String match:** Now for 0 bronbeek object, we can potentially project possible location.\n",
    "- **Initial+surname match:** Now for 1841 bronbeek objects, we can potentially project possible location.\n",
    "- **Surname match:** Now for 12776 bronbeek objects, we can potentially project possible location.\n",
    "- **Fuzzy String match:** Now for 16503 bronbeek objects, we can potentially project possible location."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ-5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "\n",
    "SELECT (AVG(?n) AS ?avg) WHERE\n",
    "{\n",
    "  SELECT (COUNT(DISTINCT ?nmvw_obj) AS ?n) \n",
    "  WHERE{\n",
    "      GRAPH <https://pressingmatter.nl/NMVW/ccrdfhiseve.ttl>{\n",
    "      ?histevet a crm:E7_Activity .\n",
    "      ?histevet crm:P140i_was_attributed_by ?o .\n",
    "      ?histevet  crm:P1_is_identified_by ?title .\n",
    "      ?histevet crm:P4_has_time-span [crm:P82a_begin_of_the_begin ?histevet_btime;\n",
    "                                       crm:P82b_end_of_the_end ?histevet_etime] .\n",
    "      ?title crm:P190_has_symbolic_content ?histevet_name .\n",
    "      ?o a crm:E13_Attribute_Assignment .\n",
    "      ?o crm:P141_assigned ?nmvw_obj .\n",
    "    } \n",
    "    ?nmvw_obj a crm:E22_Human-Made_Object .\n",
    "}GROUP BY ?histevet\n",
    "}\n",
    "```\n",
    "> Average object per event: 261.941 with 51 event"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to download ([CQ5_nmvw.csv](CQ5_nmvw.csv))\n",
    "\n",
    "```\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "\n",
    "SELECT ?histevet ?histevet_btime ?histevet_etime ?nmvw_obj ?nmvw_actor \n",
    "  WHERE{\n",
    "      GRAPH <https://pressingmatter.nl/NMVW/ccrdfhiseve.ttl>{\n",
    "      ?histevet a crm:E7_Activity .\n",
    "      ?histevet crm:P140i_was_attributed_by ?o .\n",
    "      ?histevet  crm:P1_is_identified_by ?title .\n",
    "      ?histevet crm:P4_has_time-span [crm:P82a_begin_of_the_begin ?histevet_btime;\n",
    "                                       crm:P82b_end_of_the_end ?histevet_etime] .\n",
    "      ?title crm:P190_has_symbolic_content ?histevet_name .\n",
    "      ?o a crm:E13_Attribute_Assignment .\n",
    "      ?o crm:P141_assigned ?nmvw_obj .\n",
    "    } \n",
    "    ?nmvw_obj a crm:E22_Human-Made_Object .\n",
    "    ?nmvw_acq crm:P24_transferred_title_of ?nmvw_obj .\n",
    "    ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor .\t\n",
    "  \t?nmvw_actor owl:sameAs ?bb_actor .\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "\n",
    "SELECT ?histevet ?histevet_btime ?histevet_etime ?nmvw_obj ?nmvw_actor \n",
    "  WHERE{\n",
    "    ?nmvw_actor owl:sameAs ?bb_actor .\n",
    "    ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor .\t\n",
    "    ?nmvw_acq crm:P24_transferred_title_of ?nmvw_obj .\n",
    "    ?nmvw_obj a crm:E22_Human-Made_Object .\n",
    "  GRAPH <https://pressingmatter.nl/NMVW/ccrdfhiseve.ttl>{\n",
    "    ?o crm:P141_assigned ?nmvw_obj .\n",
    "    ?o a crm:E13_Attribute_Assignment .\n",
    "    ?histevet crm:P140i_was_attributed_by ?o .\n",
    "    ?histevet a crm:E7_Activity .\n",
    "    ?histevet  crm:P1_is_identified_by ?title .\n",
    "    ?histevet crm:P4_has_time-span [crm:P82a_begin_of_the_begin ?histevet_btime;\n",
    "                                       crm:P82b_end_of_the_end ?histevet_etime] .\n",
    "    ?title crm:P190_has_symbolic_content ?histevet_name .      \n",
    "    } \n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "def cleanup_time(x: str):\n",
    "    # print(type(x))\n",
    "    return int(str(x).replace('\"', '').strip()[:4])\n",
    "\n",
    "df1 = pd.read_csv(\"CQ5_nmvw.csv\")\n",
    "df1 = df1.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = [ \"histevet\" , \"histevet_btime\" , \"histevet_etime\" , \"nmvw_obj\" , \"nmvw_actor\"]\n",
    "df1['histevet_btime'] = df1['histevet_btime'].apply(cleanup_time)\n",
    "df1['histevet_etime'] = df1['histevet_etime'].apply(cleanup_time)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total distinct obj:1417 \n",
      "Total distinct actor: 36\n",
      "Avg object: 39.361111111111114\n"
     ]
    }
   ],
   "source": [
    "print(f\"Total distinct obj:{df1['nmvw_obj'].nunique()} \\nTotal distinct actor: {df1['nmvw_actor'].nunique()}\\nAvg object: {df1['nmvw_obj'].nunique()/df1['nmvw_actor'].nunique()}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>histevet</th>\n",
       "      <th>histevet_btime</th>\n",
       "      <th>histevet_etime</th>\n",
       "      <th>nmvw_actor</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event31</td>\n",
       "      <td>1935</td>\n",
       "      <td>1936</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event11</td>\n",
       "      <td>1906</td>\n",
       "      <td>1906</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2664</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event13</td>\n",
       "      <td>1920</td>\n",
       "      <td>1921</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>240</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event15</td>\n",
       "      <td>1936</td>\n",
       "      <td>1936</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi6890</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>330</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi21230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>331</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3325</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>333</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7750</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>339</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi56724</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>383</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>416</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3153</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>427</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi81966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>442</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi4862</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>487</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi5957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>498</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>528</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi849</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>663</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi28261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>670</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi45292</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>698</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi1790</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>702</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi8273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>725</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi21590</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>772</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>817</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi1422</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>831</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi1111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>844</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7087</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>946</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi1862</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1064</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi77392</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1269</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi4284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1296</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event423</td>\n",
       "      <td>1873</td>\n",
       "      <td>1942</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7779</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1343</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event424</td>\n",
       "      <td>1859</td>\n",
       "      <td>1916</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi56613</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1518</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event424</td>\n",
       "      <td>1859</td>\n",
       "      <td>1916</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3433</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1561</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event425</td>\n",
       "      <td>1872</td>\n",
       "      <td>1907</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3325</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1563</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event425</td>\n",
       "      <td>1872</td>\n",
       "      <td>1907</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1585</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event426</td>\n",
       "      <td>1900</td>\n",
       "      <td>1907</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi69459</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1601</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event427</td>\n",
       "      <td>1904</td>\n",
       "      <td>1910</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi69464</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1602</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event427</td>\n",
       "      <td>1904</td>\n",
       "      <td>1910</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1604</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event427</td>\n",
       "      <td>1904</td>\n",
       "      <td>1910</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi5559</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1607</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event430</td>\n",
       "      <td>1945</td>\n",
       "      <td>1949</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1632</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event433</td>\n",
       "      <td>1894</td>\n",
       "      <td>1894</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7748</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1633</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/event30</td>\n",
       "      <td>1925</td>\n",
       "      <td>1925</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38419</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          histevet  histevet_btime  \\\n",
       "0      https://hdl.handle.net/20.500.11840/event31            1935   \n",
       "64     https://hdl.handle.net/20.500.11840/event11            1906   \n",
       "96     https://hdl.handle.net/20.500.11840/event13            1920   \n",
       "240    https://hdl.handle.net/20.500.11840/event15            1936   \n",
       "330   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "331   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "333   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "339   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "383   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "416   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "427   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "442   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "487   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "498   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "528   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "663   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "670   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "698   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "702   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "725   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "772   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "817   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "831   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "844   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "946   https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "1064  https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "1269  https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "1296  https://hdl.handle.net/20.500.11840/event423            1873   \n",
       "1343  https://hdl.handle.net/20.500.11840/event424            1859   \n",
       "1518  https://hdl.handle.net/20.500.11840/event424            1859   \n",
       "1561  https://hdl.handle.net/20.500.11840/event425            1872   \n",
       "1563  https://hdl.handle.net/20.500.11840/event425            1872   \n",
       "1585  https://hdl.handle.net/20.500.11840/event426            1900   \n",
       "1601  https://hdl.handle.net/20.500.11840/event427            1904   \n",
       "1602  https://hdl.handle.net/20.500.11840/event427            1904   \n",
       "1604  https://hdl.handle.net/20.500.11840/event427            1904   \n",
       "1607  https://hdl.handle.net/20.500.11840/event430            1945   \n",
       "1632  https://hdl.handle.net/20.500.11840/event433            1894   \n",
       "1633   https://hdl.handle.net/20.500.11840/event30            1925   \n",
       "\n",
       "      histevet_etime                                   nmvw_actor  \n",
       "0               1936    https://hdl.handle.net/20.500.11840/pi703  \n",
       "64              1906   https://hdl.handle.net/20.500.11840/pi2664  \n",
       "96              1921    https://hdl.handle.net/20.500.11840/pi703  \n",
       "240             1936   https://hdl.handle.net/20.500.11840/pi6890  \n",
       "330             1942  https://hdl.handle.net/20.500.11840/pi21230  \n",
       "331             1942   https://hdl.handle.net/20.500.11840/pi3325  \n",
       "333             1942   https://hdl.handle.net/20.500.11840/pi7750  \n",
       "339             1942  https://hdl.handle.net/20.500.11840/pi56724  \n",
       "383             1942   https://hdl.handle.net/20.500.11840/pi3581  \n",
       "416             1942   https://hdl.handle.net/20.500.11840/pi3153  \n",
       "427             1942  https://hdl.handle.net/20.500.11840/pi81966  \n",
       "442             1942   https://hdl.handle.net/20.500.11840/pi4862  \n",
       "487             1942   https://hdl.handle.net/20.500.11840/pi5957  \n",
       "498             1942    https://hdl.handle.net/20.500.11840/pi499  \n",
       "528             1942    https://hdl.handle.net/20.500.11840/pi849  \n",
       "663             1942  https://hdl.handle.net/20.500.11840/pi28261  \n",
       "670             1942  https://hdl.handle.net/20.500.11840/pi45292  \n",
       "698             1942   https://hdl.handle.net/20.500.11840/pi1790  \n",
       "702             1942   https://hdl.handle.net/20.500.11840/pi8273  \n",
       "725             1942  https://hdl.handle.net/20.500.11840/pi21590  \n",
       "772             1942   https://hdl.handle.net/20.500.11840/pi3433  \n",
       "817             1942   https://hdl.handle.net/20.500.11840/pi1422  \n",
       "831             1942   https://hdl.handle.net/20.500.11840/pi1111  \n",
       "844             1942   https://hdl.handle.net/20.500.11840/pi7087  \n",
       "946             1942   https://hdl.handle.net/20.500.11840/pi1862  \n",
       "1064            1942  https://hdl.handle.net/20.500.11840/pi77392  \n",
       "1269            1942   https://hdl.handle.net/20.500.11840/pi4284  \n",
       "1296            1942   https://hdl.handle.net/20.500.11840/pi7779  \n",
       "1343            1916  https://hdl.handle.net/20.500.11840/pi56613  \n",
       "1518            1916   https://hdl.handle.net/20.500.11840/pi3433  \n",
       "1561            1907   https://hdl.handle.net/20.500.11840/pi3325  \n",
       "1563            1907   https://hdl.handle.net/20.500.11840/pi3523  \n",
       "1585            1907  https://hdl.handle.net/20.500.11840/pi69459  \n",
       "1601            1910  https://hdl.handle.net/20.500.11840/pi69464  \n",
       "1602            1910   https://hdl.handle.net/20.500.11840/pi3589  \n",
       "1604            1910   https://hdl.handle.net/20.500.11840/pi5559  \n",
       "1607            1949   https://hdl.handle.net/20.500.11840/pi2330  \n",
       "1632            1894   https://hdl.handle.net/20.500.11840/pi7748  \n",
       "1633            1925  https://hdl.handle.net/20.500.11840/pi38419  "
      ]
     },
     "execution_count": 112,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# drop the nmvw_obj\n",
    "df1 = df1.drop(['nmvw_obj'], axis=1)\n",
    "# Remove duplicate actor to event connections\n",
    "df1 = df1.drop_duplicates()\n",
    "df1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate [CQ5_bb.csv](CQ5_bb.csv)\n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX aat: <http://vocab.getty.edu/aat/>\n",
    "\n",
    "SELECT ?bb_obj ?bb_actor ?nmvw_actor ?b_time ?e_time\n",
    "WHERE{\n",
    "  \t?nmvw_actor owl:sameAs ?bb_actor .\n",
    "  \t?bb_acq2 crm:P23_transferred_title_from ?bb_actor . \n",
    "  \t?bb_acq2 crm:P24_transferred_title_of ?bb_obj .\n",
    "    ?prov_activity  crm:P9_consists_of ?bb_acq2 .\n",
    "    ?prov_activity crm:P2_has_type aat:300055863 .\n",
    "  \t\n",
    "    ?prov_activity crm:P9_consists_of ?bb_acq .\n",
    "  \t?bb_acq crm:P24_transferred_title_of ?bb_obj .\n",
    "\t  ?bb_acq crm:P4_has_time-span ?time .\n",
    "  \t?time crm:P82a_begin_of_the_begin ?b_time .\n",
    "    ?time crm:P82b_end_of_the_end ?e_time.\n",
    "  FILTER (?bb_acq != ?bb_acq2) .\n",
    "\n",
    "GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_obj a crm:E22_Human-Made_Object. }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>bb_obj</th>\n",
       "      <th>bb_actor</th>\n",
       "      <th>nmvw_actor</th>\n",
       "      <th>b_time</th>\n",
       "      <th>e_time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [bb_obj, bb_actor, nmvw_actor, b_time, e_time]\n",
       "Index: []"
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup_time(x: str):\n",
    "    # Check if x is not None and not an empty string\n",
    "    try:\n",
    "        if x == \"None\" :\n",
    "            return 0\n",
    "        if x and str(x).strip():\n",
    "            # Convert the cleaned string to an integer\n",
    "            return int(str(x).replace('\"', '').strip()[:4])\n",
    "    except ValueError:\n",
    "        return 0\n",
    "\n",
    "# Read the second CSV file into DataFrame df2\n",
    "df2 = pd.read_csv(\"CQ5_bb.csv\")\n",
    "df2 = df2.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "\n",
    "# df2 = df2.iloc[: , :-1]\n",
    "df2.columns = [\"bb_obj\" , \"bb_actor\" , \"nmvw_actor\" , \"b_time\" , \"e_time\"]\n",
    "df2['b_time'] = df2['b_time'].apply(cleanup_time)\n",
    "df2['e_time'] = df2['e_time'].apply(cleanup_time)\n",
    "\n",
    "# Remove duplicate rows in df2\n",
    "df2 = df2.drop_duplicates() \n",
    "\n",
    "# remove bb_actor matched to multiple nmvw_actor\n",
    "# df2 = df2.drop_duplicates(subset=['bb_obj'])\n",
    "\n",
    "# Extract unique 'nmvw_actor' values from df2\n",
    "unique_nmvw_actor = df1['nmvw_actor'].unique()\n",
    "\n",
    "# Filter df2 to keep only rows where 'nmvw_actor' exists in df2\n",
    "df2= df2[df2['nmvw_actor'].isin(unique_nmvw_actor)]\n",
    "\n",
    "df2 = df2.sort_values('bb_actor')\n",
    "\n",
    "df2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 object has connection with actors where actor has connection with historical event with 0 unique actor\n"
     ]
    }
   ],
   "source": [
    "print(f\"{df2['bb_obj'].nunique()} object has connection with actors where actor has connection with historical event with {df2['nmvw_actor'].nunique()} unique actor\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "48750"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "35391 + 13359"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ-6a"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate [CQ6a_nmvw.csv](CQ6a_nmvw.csv): \n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX aat: <http://vocab.getty.edu/aat/>\n",
    "\n",
    "SELECT ?nmvw_obj ?nmvw_actor ?b_time ?e_time\n",
    "WHERE{\n",
    " GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "     ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor.\n",
    "     ?nmvw_acq crm:P24_transferred_title_of ?nmvw_obj .\n",
    "     ?prov_activity ?p ?nmvw_acq.\n",
    "     ?prov_activity crm:P2_has_type aat:300055863 .\n",
    "     ?prov_activity crm:P4_has_time-span ?time .\n",
    "     ?time crm:P82a_begin_of_the_begin ?b_time .\n",
    "     ?time crm:P82b_end_of_the_end ?e_time.\n",
    "    }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nmvw_obj</th>\n",
       "      <th>nmvw_actor</th>\n",
       "      <th>b_time</th>\n",
       "      <th>e_time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/128787</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2338</td>\n",
       "      <td>1972</td>\n",
       "      <td>1972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/283554</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3989</td>\n",
       "      <td>1969</td>\n",
       "      <td>1969</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/300252</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi40581</td>\n",
       "      <td>1922</td>\n",
       "      <td>1922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/143099</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3683</td>\n",
       "      <td>1978</td>\n",
       "      <td>1978</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302925</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3596</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/235554</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38479</td>\n",
       "      <td>2003</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3597</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/235555</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38479</td>\n",
       "      <td>2003</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3598</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/235556</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38479</td>\n",
       "      <td>2003</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3599</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/235557</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38479</td>\n",
       "      <td>2003</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3600</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/235558</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38479</td>\n",
       "      <td>2003</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3601 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        nmvw_obj  \\\n",
       "0     https://hdl.handle.net/20.500.11840/128787   \n",
       "1     https://hdl.handle.net/20.500.11840/283554   \n",
       "2     https://hdl.handle.net/20.500.11840/300252   \n",
       "3     https://hdl.handle.net/20.500.11840/143099   \n",
       "4     https://hdl.handle.net/20.500.11840/302925   \n",
       "...                                          ...   \n",
       "3596  https://hdl.handle.net/20.500.11840/235554   \n",
       "3597  https://hdl.handle.net/20.500.11840/235555   \n",
       "3598  https://hdl.handle.net/20.500.11840/235556   \n",
       "3599  https://hdl.handle.net/20.500.11840/235557   \n",
       "3600  https://hdl.handle.net/20.500.11840/235558   \n",
       "\n",
       "                                       nmvw_actor  b_time  e_time  \n",
       "0      https://hdl.handle.net/20.500.11840/pi2338    1972    1972  \n",
       "1      https://hdl.handle.net/20.500.11840/pi3989    1969    1969  \n",
       "2     https://hdl.handle.net/20.500.11840/pi40581    1922    1922  \n",
       "3      https://hdl.handle.net/20.500.11840/pi3683    1978    1978  \n",
       "4     https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "...                                           ...     ...     ...  \n",
       "3596  https://hdl.handle.net/20.500.11840/pi38479    2003    2003  \n",
       "3597  https://hdl.handle.net/20.500.11840/pi38479    2003    2003  \n",
       "3598  https://hdl.handle.net/20.500.11840/pi38479    2003    2003  \n",
       "3599  https://hdl.handle.net/20.500.11840/pi38479    2003    2003  \n",
       "3600  https://hdl.handle.net/20.500.11840/pi38479    2003    2003  \n",
       "\n",
       "[3601 rows x 4 columns]"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup_time(x: str):\n",
    "    return int(str(x).replace('\"', '').strip()[-4:])\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"CQ6a_nmvw.csv\")\n",
    "df1 = df1.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "df1 = df1.iloc[: , :-1]\n",
    "\n",
    "df1.columns = ['nmvw_obj', 'nmvw_actor', 'b_time', 'e_time']\n",
    "df1['b_time'] = df1['b_time'].apply(cleanup_time)\n",
    "df1['e_time'] = df1['e_time'].apply(cleanup_time)\n",
    "df1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of objects that can be connected with at least one other object \n",
      "based on they are connected by same actor during similar time is: 3526\n"
     ]
    }
   ],
   "source": [
    "grouped_df = df1.groupby(['nmvw_actor', 'b_time', 'e_time'])['nmvw_obj'].nunique().reset_index()\n",
    "grouped_df = grouped_df.sort_values(by='nmvw_obj', ascending=False)\n",
    "grouped_df = grouped_df[grouped_df['nmvw_obj'] != 1]\n",
    "print(f\"Number of objects that can be connected with at least one other object \\nbased on they are connected by same actor during similar time is: {grouped_df['nmvw_obj'].sum()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate: [CQ6a_bb.csv](CQ6a_bb.csv)\n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX aat: <http://vocab.getty.edu/aat/>\n",
    "\n",
    "SELECT ?bb_obj ?bb_actor ?nmvw_actor ?b_time ?e_time\n",
    "WHERE{\n",
    "  \t?nmvw_actor owl:sameAs ?bb_actor .\n",
    "  \t?bb_acq2 crm:P23_transferred_title_from ?bb_actor . \n",
    "  \t?bb_acq2 crm:P24_transferred_title_of ?bb_obj .\n",
    "    ?prov_activity  crm:P9_consists_of ?bb_acq2 .\n",
    "    ?prov_activity crm:P2_has_type aat:300055863 .\n",
    "  \t\n",
    "    ?prov_activity crm:P9_consists_of ?bb_acq .\n",
    "  \t?bb_acq crm:P24_transferred_title_of ?bb_obj .\n",
    "\t  ?bb_acq crm:P4_has_time-span ?time .\n",
    "  \t?time crm:P82a_begin_of_the_begin ?b_time .\n",
    "    ?time crm:P82b_end_of_the_end ?e_time.\n",
    "  FILTER (?bb_acq != ?bb_acq2) .\n",
    "\n",
    "GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_obj a crm:E22_Human-Made_Object. }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cleanup_time(x: str):\n",
    "    # Check if x is not None and not an empty string\n",
    "    try:\n",
    "        if x == \"None\" :\n",
    "            return 0\n",
    "        if x and str(x).strip():\n",
    "            # Convert the cleaned string to an integer\n",
    "            return int(str(x).replace('\"', '').strip()[:4])\n",
    "    except ValueError:\n",
    "        return 0\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df2 = pd.read_csv(\"CQ6a_bb.csv\")\n",
    "# df2 = df2.iloc[: , :-1]\n",
    "df2.columns = ['bb_obj', 'bb_actor', 'nmvw_actor', 'b_time', 'e_time']\n",
    "df2['b_time'] = df2['b_time'].apply(cleanup_time)\n",
    "df2['e_time'] = df2['e_time'].apply(cleanup_time)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nmvw_obj,nmvw_actor,b_time_x,e_time_x,bb_obj,bb_actor,b_time_y,e_time_y,time_diff_b,time_diff_e\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/66596,https://pressingmatter.nl/Bronbeek/Constituents/12755,2015,2015,2,2\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/83853,https://pressingmatter.nl/Bronbeek/Constituents/14238,2017,2017,4,4\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/11734,https://pressingmatter.nl/Bronbeek/Constituents/2375,1994,1994,-19,-19\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/11735,https://pressingmatter.nl/Bronbeek/Constituents/2375,1994,1994,-19,-19\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/36059,https://pressingmatter.nl/Bronbeek/Constituents/6303,2005,2005,-8,-8\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/47150,https://pressingmatter.nl/Bronbeek/Constituents/8713,2008,2008,-5,-5\n",
      "https://hdl.handle.net/20.500.11840/209379,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209379,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209382,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209382,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209383,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209383,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209384,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209384,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209385,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209385,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209386,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209386,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209387,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209387,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209388,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209388,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/224058,https://hdl.handle.net/20.500.11840/pi6788,1999,1999,https://pressingmatter.nl/Bronbeek/Objects/70926,https://pressingmatter.nl/Bronbeek/Constituents/13446,2016,2016,17,17\n",
      "\n",
      "Number of rows in result_df: 23\n"
     ]
    }
   ],
   "source": [
    "def merge_with_condition(df1, df2):\n",
    "    merged_df = pd.merge(df1, df2, on='nmvw_actor', how='inner')\n",
    "    merged_df['time_diff_b'] = merged_df['b_time_y'] - merged_df['b_time_x']\n",
    "    merged_df['time_diff_e'] = merged_df['e_time_y'] - merged_df['e_time_x']\n",
    "    condition = (abs(merged_df['time_diff_b']) <= 20) & (abs(merged_df['time_diff_e']) <= 20)\n",
    "    return merged_df[condition]\n",
    "\n",
    "# Merge the dataframes based on the custom condition\n",
    "result_df = merge_with_condition(df1, df2)\n",
    "print(result_df.to_csv(index=False))\n",
    "print(\"Number of rows in result_df:\", len(result_df))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unique NMVW actor: 3\n"
     ]
    }
   ],
   "source": [
    "print(f\"Unique NMVW actor: {result_df['nmvw_actor'].nunique()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ-6b"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate [CQ6b_nmvw.csv](CQ6b_nmvw.csv): \n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX aat: <http://vocab.getty.edu/aat/>\n",
    "\n",
    "SELECT ?nmvw_obj ?nmvw_actor ?b_time ?e_time\n",
    "WHERE{\n",
    " GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "     ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor.\n",
    "     ?nmvw_acq crm:P24_transferred_title_of ?nmvw_obj .\n",
    "     ?prov_activity ?p ?nmvw_acq.\n",
    "     ?prov_activity crm:P2_has_type aat:300055863 .\n",
    "     OPTIONAL{\n",
    "             ?prov_activity crm:P4_has_time-span ?time .\n",
    "             ?time crm:P82a_begin_of_the_begin ?b_time .\n",
    "             ?time crm:P82b_end_of_the_end ?e_time.\n",
    "     }\n",
    "    }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nmvw_obj</th>\n",
       "      <th>nmvw_actor</th>\n",
       "      <th>b_time</th>\n",
       "      <th>e_time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/140235</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2246</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/140450</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2432</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/22139</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7008</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/22199</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2354</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/22201</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7008</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>528651</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/21777</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi7008</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>528652</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/21777</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi39586</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>528653</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/276706</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi5989</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>528654</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/240</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi4332</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>528655</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/26</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi4332</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>528656 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          nmvw_obj  \\\n",
       "0       https://hdl.handle.net/20.500.11840/140235   \n",
       "1       https://hdl.handle.net/20.500.11840/140450   \n",
       "2        https://hdl.handle.net/20.500.11840/22139   \n",
       "3        https://hdl.handle.net/20.500.11840/22199   \n",
       "4        https://hdl.handle.net/20.500.11840/22201   \n",
       "...                                            ...   \n",
       "528651   https://hdl.handle.net/20.500.11840/21777   \n",
       "528652   https://hdl.handle.net/20.500.11840/21777   \n",
       "528653  https://hdl.handle.net/20.500.11840/276706   \n",
       "528654     https://hdl.handle.net/20.500.11840/240   \n",
       "528655      https://hdl.handle.net/20.500.11840/26   \n",
       "\n",
       "                                         nmvw_actor  b_time  e_time  \n",
       "0        https://hdl.handle.net/20.500.11840/pi2246     NaN     NaN  \n",
       "1        https://hdl.handle.net/20.500.11840/pi2432     NaN     NaN  \n",
       "2        https://hdl.handle.net/20.500.11840/pi7008     NaN     NaN  \n",
       "3        https://hdl.handle.net/20.500.11840/pi2354     NaN     NaN  \n",
       "4        https://hdl.handle.net/20.500.11840/pi7008     NaN     NaN  \n",
       "...                                             ...     ...     ...  \n",
       "528651   https://hdl.handle.net/20.500.11840/pi7008     NaN     NaN  \n",
       "528652  https://hdl.handle.net/20.500.11840/pi39586     NaN     NaN  \n",
       "528653   https://hdl.handle.net/20.500.11840/pi5989     NaN     NaN  \n",
       "528654   https://hdl.handle.net/20.500.11840/pi4332     NaN     NaN  \n",
       "528655   https://hdl.handle.net/20.500.11840/pi4332     NaN     NaN  \n",
       "\n",
       "[528656 rows x 4 columns]"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup_time(x: str):\n",
    "    try:\n",
    "        return int(str(x).replace('\"', '').strip()[-4:])\n",
    "    except ValueError:\n",
    "        return None\n",
    "\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"CQ6b_nmvw.csv\")\n",
    "df1 = df1.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = ['nmvw_obj', 'nmvw_actor', 'b_time', 'e_time']\n",
    "df1['b_time'] = df1['b_time'].apply(cleanup_time)\n",
    "df1['e_time'] = df1['e_time'].apply(cleanup_time)\n",
    "df1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The number of objects we can possibly project the time of acquisition is: 40186\n"
     ]
    }
   ],
   "source": [
    "df1_time_known = df1.dropna(subset=['b_time', 'e_time'])\n",
    "\n",
    "grouped_all_df1 = df1.groupby(['nmvw_actor'])['nmvw_obj'].nunique().reset_index()\n",
    "grouped_all_df1 = grouped_all_df1.sort_values(by='nmvw_obj', ascending=False)\n",
    "\n",
    "grouped_known_df1 = df1_time_known.groupby(['nmvw_actor'])['nmvw_obj'].nunique().reset_index()\n",
    "grouped_known_df1 = grouped_known_df1.sort_values(by='nmvw_obj', ascending=False)\n",
    "\n",
    "merged_df1 = pd.merge(grouped_known_df1, grouped_all_df1, on='nmvw_actor', how='inner')\n",
    "merged_df1['obj_time_unknown'] = merged_df1['nmvw_obj_y'] - merged_df1['nmvw_obj_x']\n",
    "print(f\"The number of objects we can possibly project the time of acquisition is: {merged_df1['obj_time_unknown'].sum()}\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate: [CQ6b_bb.csv](CQ6b_bb.csv)\n",
    "\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX aat: <http://vocab.getty.edu/aat/>\n",
    "\n",
    "SELECT ?bb_obj ?bb_actor ?nmvw_actor ?b_time ?e_time\n",
    "WHERE{\n",
    "  \t?nmvw_actor owl:sameAs ?bb_actor .\n",
    "  \t?bb_acq2 crm:P23_transferred_title_from ?bb_actor . \n",
    "  \t?bb_acq2 crm:P24_transferred_title_of ?bb_obj .\n",
    "    ?prov_activity  crm:P9_consists_of ?bb_acq2 .\n",
    "    ?prov_activity crm:P2_has_type aat:300055863 .\n",
    "  \t\n",
    "    ?prov_activity crm:P9_consists_of ?bb_acq .\n",
    "  \t?bb_acq crm:P24_transferred_title_of ?bb_obj .\n",
    "\t  ?bb_acq crm:P4_has_time-span ?time .\n",
    "  \t?time crm:P82a_begin_of_the_begin ?b_time .\n",
    "    ?time crm:P82b_end_of_the_end ?e_time.\n",
    "  FILTER (?bb_acq != ?bb_acq2) .\n",
    "\n",
    "GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_obj a crm:E22_Human-Made_Object. }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cleanup_time(x: str):\n",
    "    # Check if x is not None and not an empty string\n",
    "    try:\n",
    "        if x == \"None\" :\n",
    "            return 0\n",
    "        if x and str(x).strip():\n",
    "            # Convert the cleaned string to an integer\n",
    "            return int(str(x).replace('\"', '').strip()[:4])\n",
    "    except ValueError:\n",
    "        return 0\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df2 = pd.read_csv(\"CQ6b_bb.csv\")\n",
    "# df2 = df2.iloc[: , :-1]\n",
    "df2.columns = ['bb_obj', 'bb_actor', 'nmvw_actor', 'b_time', 'e_time']\n",
    "df2['b_time'] = df2['b_time'].apply(cleanup_time)\n",
    "df2['e_time'] = df2['e_time'].apply(cleanup_time)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There is 163 objects from bronbeek dataset where don't know the acquisition date \n",
      "and from the same collector, we know some acquisition date for nmvw object\n"
     ]
    }
   ],
   "source": [
    "filtered_df2 = df2[(df2['b_time'] == 0) & (df2['e_time'] == 0)]\n",
    "\n",
    "# filtered_df2 = filtered_df2.drop_duplicates(subset=['bb_obj'])\n",
    "\n",
    "grouped_unknown_df2 = filtered_df2.groupby(['nmvw_actor'])['bb_obj'].nunique().reset_index()\n",
    "grouped_unknown_df2 = grouped_unknown_df2.sort_values(by='bb_obj', ascending=False)\n",
    "\n",
    "merged_df2 = pd.merge(grouped_known_df1, grouped_unknown_df2, on='nmvw_actor', how='inner')\n",
    "print(f\"There is {merged_df2['bb_obj'].sum()} objects from bronbeek dataset where don't know the acquisition date \\nand from the same collector, we know some acquisition date for nmvw object\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> same object can appear multiple times"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unique NMVW actor: 7\n"
     ]
    }
   ],
   "source": [
    "print(f\"Unique NMVW actor: {merged_df2['nmvw_actor'].nunique()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# CQ-6c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate [CQ6c_nmvw.csv](CQ6c_nmvw.csv): \n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX aat: <http://vocab.getty.edu/aat/>\n",
    "\n",
    "SELECT ?nmvw_obj ?nmvw_prod_place ?nmvw_actor ?b_time ?e_time\n",
    "WHERE{\n",
    " GRAPH <https://pressingmatter.nl/NMVW/ccrdfobj.ttl>{\n",
    "     ?nmvw_acq crm:P23_transferred_title_from ?nmvw_actor.\n",
    "     ?nmvw_acq crm:P24_transferred_title_of ?nmvw_obj .\n",
    "     ?nmvw_obj crm:P108i_was_produced_by ?nmvw_prod .\n",
    "     ?nmvw_prod crm:P7_took_place_at ?nmvw_prod_place.\n",
    "     ?prov_activity ?p ?nmvw_acq.\n",
    "     ?prov_activity crm:P2_has_type aat:300055863 .\n",
    "     ?prov_activity crm:P4_has_time-span ?time .\n",
    "     ?time crm:P82a_begin_of_the_begin ?b_time .\n",
    "     ?time crm:P82b_end_of_the_end ?e_time.\n",
    "    }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nmvw_obj</th>\n",
       "      <th>nmvw_prod_place</th>\n",
       "      <th>nmvw_actor</th>\n",
       "      <th>b_time</th>\n",
       "      <th>e_time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/128787</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi2338</td>\n",
       "      <td>1972</td>\n",
       "      <td>1972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/283554</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster470</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3989</td>\n",
       "      <td>1969</td>\n",
       "      <td>1969</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/143099</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi3683</td>\n",
       "      <td>1978</td>\n",
       "      <td>1978</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302925</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302926</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302927</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302928</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302929</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302930</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302931</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302932</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302933</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302934</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302935</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>https://hdl.handle.net/20.500.11840/302936</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/termmaster...</td>\n",
       "      <td>https://hdl.handle.net/20.500.11840/pi38456</td>\n",
       "      <td>2003</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      nmvw_obj  \\\n",
       "0   https://hdl.handle.net/20.500.11840/128787   \n",
       "1   https://hdl.handle.net/20.500.11840/283554   \n",
       "2   https://hdl.handle.net/20.500.11840/143099   \n",
       "3   https://hdl.handle.net/20.500.11840/302925   \n",
       "4   https://hdl.handle.net/20.500.11840/302926   \n",
       "5   https://hdl.handle.net/20.500.11840/302927   \n",
       "6   https://hdl.handle.net/20.500.11840/302928   \n",
       "7   https://hdl.handle.net/20.500.11840/302929   \n",
       "8   https://hdl.handle.net/20.500.11840/302930   \n",
       "9   https://hdl.handle.net/20.500.11840/302931   \n",
       "10  https://hdl.handle.net/20.500.11840/302932   \n",
       "11  https://hdl.handle.net/20.500.11840/302933   \n",
       "12  https://hdl.handle.net/20.500.11840/302934   \n",
       "13  https://hdl.handle.net/20.500.11840/302935   \n",
       "14  https://hdl.handle.net/20.500.11840/302936   \n",
       "\n",
       "                                      nmvw_prod_place  \\\n",
       "0   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "1   https://hdl.handle.net/20.500.11840/termmaster470   \n",
       "2   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "3   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "4   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "5   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "6   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "7   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "8   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "9   https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "10  https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "11  https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "12  https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "13  https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "14  https://hdl.handle.net/20.500.11840/termmaster...   \n",
       "\n",
       "                                     nmvw_actor  b_time  e_time  \n",
       "0    https://hdl.handle.net/20.500.11840/pi2338    1972    1972  \n",
       "1    https://hdl.handle.net/20.500.11840/pi3989    1969    1969  \n",
       "2    https://hdl.handle.net/20.500.11840/pi3683    1978    1978  \n",
       "3   https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "4   https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "5   https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "6   https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "7   https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "8   https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "9   https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "10  https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "11  https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "12  https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "13  https://hdl.handle.net/20.500.11840/pi38456    2003    2008  \n",
       "14  https://hdl.handle.net/20.500.11840/pi38456    2003    2008  "
      ]
     },
     "execution_count": 83,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def cleanup_time(x: str):\n",
    "    return int(str(x).replace('\"', '').strip()[-4:])\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df1 = pd.read_csv(\"CQ6c_nmvw.csv\")\n",
    "df1 = df1.map(lambda x: x.replace('\"', '').strip() if isinstance(x, str) else x)\n",
    "df1 = df1.iloc[: , :-1]\n",
    "df1.columns = ['nmvw_obj', 'nmvw_prod_place', 'nmvw_actor', 'b_time', 'e_time']\n",
    "df1['b_time'] = df1['b_time'].apply(cleanup_time)\n",
    "df1['e_time'] = df1['e_time'].apply(cleanup_time)\n",
    "df1.head(15)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of objects that can be connected with at least one other object \n",
      "based on they are connected by same actor during similar time and similar location is: 3295\n"
     ]
    }
   ],
   "source": [
    "grouped_df1 = df1.groupby(['nmvw_actor', 'nmvw_prod_place', 'b_time', 'e_time'])['nmvw_obj'].nunique().reset_index()\n",
    "grouped_df1 = grouped_df1.sort_values(by='nmvw_obj', ascending=False)\n",
    "grouped_df1 = grouped_df1[grouped_df1['nmvw_obj'] != 1]\n",
    "\n",
    "print(f\"Number of objects that can be connected with at least one other object \\nbased on they are connected by same actor during similar time and similar location is: {grouped_df1['nmvw_obj'].sum()}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to generate: [CQ6c_bb.csv](CQ6c_bb.csv)\n",
    "```\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX aat: <http://vocab.getty.edu/aat/>\n",
    "\n",
    "SELECT ?bb_obj ?bb_actor ?nmvw_actor ?b_time ?e_time\n",
    "WHERE{\n",
    "  \t?nmvw_actor owl:sameAs ?bb_actor .\n",
    "  \t?bb_acq2 crm:P23_transferred_title_from ?bb_actor . \n",
    "  \t?bb_acq2 crm:P24_transferred_title_of ?bb_obj .\n",
    "    ?prov_activity  crm:P9_consists_of ?bb_acq2 .\n",
    "    ?prov_activity crm:P2_has_type aat:300055863 .\n",
    "  \t\n",
    "    ?prov_activity crm:P9_consists_of ?bb_acq .\n",
    "  \t?bb_acq crm:P24_transferred_title_of ?bb_obj .\n",
    "\t  ?bb_acq crm:P4_has_time-span ?time .\n",
    "  \t?time crm:P82a_begin_of_the_begin ?b_time .\n",
    "    ?time crm:P82b_end_of_the_end ?e_time.\n",
    "  FILTER (?bb_acq != ?bb_acq2) .\n",
    "\n",
    "GRAPH <https://pressingmatter.nl/Bronbeek/Objects/Objects/assertion/bad21d24/2024-03-01T12:54>{\n",
    "    ?bb_obj a crm:E22_Human-Made_Object. }\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cleanup_time(x: str):\n",
    "    # Check if x is not None and not an empty string\n",
    "    try:\n",
    "        if x == \"None\" :\n",
    "            return 0\n",
    "        if x and str(x).strip():\n",
    "            # Convert the cleaned string to an integer\n",
    "            return int(str(x).replace('\"', '').strip()[:4])\n",
    "    except ValueError:\n",
    "        return 0\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "df2 = pd.read_csv(\"CQ6c_bb.csv\")\n",
    "# df2 = df2.iloc[: , :-1]\n",
    "df2.columns = ['bb_obj', 'bb_actor', 'nmvw_actor', 'b_time', 'e_time']\n",
    "df2['b_time'] = df2['b_time'].apply(cleanup_time)\n",
    "df2['e_time'] = df2['e_time'].apply(cleanup_time)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nmvw_obj,nmvw_prod_place,nmvw_actor,b_time_x,e_time_x,bb_obj,bb_actor,b_time_y,e_time_y,time_diff_b,time_diff_e\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/termmaster7675,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/66596,https://pressingmatter.nl/Bronbeek/Constituents/12755,2015,2015,2,2\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/termmaster7675,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/83853,https://pressingmatter.nl/Bronbeek/Constituents/14238,2017,2017,4,4\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/termmaster7675,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/11734,https://pressingmatter.nl/Bronbeek/Constituents/2375,1994,1994,-19,-19\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/termmaster7675,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/11735,https://pressingmatter.nl/Bronbeek/Constituents/2375,1994,1994,-19,-19\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/termmaster7675,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/36059,https://pressingmatter.nl/Bronbeek/Constituents/6303,2005,2005,-8,-8\n",
      "https://hdl.handle.net/20.500.11840/514830,https://hdl.handle.net/20.500.11840/termmaster7675,https://hdl.handle.net/20.500.11840/pi46567,2013,2013,https://pressingmatter.nl/Bronbeek/Objects/47150,https://pressingmatter.nl/Bronbeek/Constituents/8713,2008,2008,-5,-5\n",
      "https://hdl.handle.net/20.500.11840/209379,https://hdl.handle.net/20.500.11840/termmaster7055,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209379,https://hdl.handle.net/20.500.11840/termmaster7055,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209382,https://hdl.handle.net/20.500.11840/termmaster7057,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209382,https://hdl.handle.net/20.500.11840/termmaster7057,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209383,https://hdl.handle.net/20.500.11840/termmaster7286,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209383,https://hdl.handle.net/20.500.11840/termmaster7286,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209384,https://hdl.handle.net/20.500.11840/termmaster7054,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209384,https://hdl.handle.net/20.500.11840/termmaster7054,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209385,https://hdl.handle.net/20.500.11840/termmaster7054,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209385,https://hdl.handle.net/20.500.11840/termmaster7054,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209387,https://hdl.handle.net/20.500.11840/termmaster7055,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209387,https://hdl.handle.net/20.500.11840/termmaster7055,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209388,https://hdl.handle.net/20.500.11840/termmaster7055,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5148,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/209388,https://hdl.handle.net/20.500.11840/termmaster7055,https://hdl.handle.net/20.500.11840/pi1064,1915,1915,https://pressingmatter.nl/Bronbeek/Objects/5149,https://pressingmatter.nl/Bronbeek/Constituents/191,1898,1898,-17,-17\n",
      "https://hdl.handle.net/20.500.11840/224058,https://hdl.handle.net/20.500.11840/termmaster4630,https://hdl.handle.net/20.500.11840/pi6788,1999,1999,https://pressingmatter.nl/Bronbeek/Objects/70926,https://pressingmatter.nl/Bronbeek/Constituents/13446,2016,2016,17,17\n",
      "\n",
      "Number of rows in result_df: 21\n"
     ]
    }
   ],
   "source": [
    "def merge_with_condition(df1, df2):\n",
    "    merged_df = pd.merge(df1, df2, on='nmvw_actor', how='inner')\n",
    "    merged_df['time_diff_b'] = merged_df['b_time_y'] - merged_df['b_time_x']\n",
    "    merged_df['time_diff_e'] = merged_df['e_time_y'] - merged_df['e_time_x']\n",
    "    condition = (abs(merged_df['time_diff_b']) <= 20) & (abs(merged_df['time_diff_e']) <= 20)\n",
    "    return merged_df[condition]\n",
    "\n",
    "# Merge the dataframes based on the custom condition\n",
    "result_df = merge_with_condition(df1, df2)\n",
    "print(result_df.to_csv(index=False))\n",
    "print(\"Number of rows in result_df:\", len(result_df))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unique NMVW actor: 3\n"
     ]
    }
   ],
   "source": [
    "print(f\"Unique NMVW actor: {result_df['nmvw_actor'].nunique()}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "pm_links",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
